<%--
  Created by IntelliJ IDEA.
  User: 凯哥
  Date: 2017/5/24
  Time: 21:30
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>地图分布</title>
  <script type="text/javascript" src="http://api.map.baidu.com/api?v=2.0&ak=UfGt9nwiQMr1IjOnLGSgAXb8yGmPLAKR"></script>
  <!-- //font-awesome-icons -->
  <script type="text/javascript" src="map/echarts-all-3.js"></script>
  <script type="text/javascript" src="map/dataTool.min.js"></script>
  <script type="text/javascript" src="http://echarts.baidu.com/gallery/vendors/echarts/map/js/china.js"></script>
  <script type="text/javascript" src="map/world.js"></script>
  <script type="text/javascript" src="map/bmap.min.js"></script>
  <link href="mycss/mystyle.css"  rel="stylesheet">
  <link href="css/bootstrap.css" rel="stylesheet" type="text/css"
        media="all" />
  <link href="css/style.css" rel="stylesheet" type="text/css"
        media="all" />
  <link href="css/bootstrap.min.css" rel="stylesheet">
  <script type="text/javascript" src="js/flexy-menu.js"></script>
  <link rel="shortcut icon" href="images/pm25.png">
  <link rel="stylesheet" type="text/css" href="map/style.css">

  <style>
    .autocomplete-suggestions{position:absolute; top:64px; left:20px; width:267px; background-color:#393e45; overflow-x:hidden;margin-top:4px; z-index:20;}
    .autocomplete-suggestion{float:left; display:inline; width:267px;}
    .autocomplete-suggestion a{float:left; display:inline; width:267px; height:30px; line-height:30px; text-indent:20px; border-bottom:#2f3640 dotted 1px; color:#94a3b3;}
    .autocomplete-suggestion a:hover{background-color:#606469; color:#fff;}
  </style>
  <style>
    body{
      overflow: hidden;
      height: 100%;
      background-color: #404a59;
    }
  </style>
</head>
<body>
<div class="content2">
  <ul class="flexy-menu orange" style="height: 72px;text-align: center;">
    <li><img src=""></li>
    <li style="margin-left: 225px;"><a href="ad_index" style="height: 70px;width: 150px"><img src="images/zhuye.png" style="width: 25px;height: 25px"/>
      主页</a></li>
    <li><a href="jiance" style="height: 70px;width: 150px"><img src="images/jiance.png"  style="width: 25px;height: 25px"/>实时检测</a></li>
    <li><a href="order" style="height: 70px;width: 150px"><img src="images/pai.png"  style="width: 25px;height: 25px"/>排行榜</a>
    <li class="active" style="border-bottom:2px solid #000;"><a href="map" style="height: 70px;width: 150px"><img src="images/ditu.png"  style="width: 25px;height: 25px"/>地图分布</a>
    <li><a href="gallery" style="height: 70px;width: 150px"><img src="images/shenghuo.png"  style="width: 25px;height: 25px"/>生活小帮手</a></li>
    <li><a href="contact" style="height: 70px;width: 150px"><img src="images/pm.png"  style="width: 25px;height: 25px"/>PM 2.5 防护</a></li>
  </ul>
</div>

<div class="col-md-12 column">
  <div class="row clearfix">
    <div class="col-md-3 column" style="background: #282E33;margin-top: -37px;border-right: 1px solid #000;">
      <div style="overflow:auto;height: 600px;width: 300px;">
        <div align="center" style="height: 85px">
          <input type="text" placeholder="请输入关键词" style="height: 30px;width: 220px;"/><input type="button" class="tijiao">
          <script type="text/javascript" src="map/index.js"></script>
        </div>
        <hr style="border: 1px solid #2d3943;width: 339px;position: absolute;left: 0px;top:66px">
        <div style="height: 210px">
          <p style="color: #d9d3db;font-size: 20px;margin-top: 20px">您所在的城市：${city}</p>
        </div>
      </div>
    </div>
    <div class="col-md-9 column">
      <div style="height: 89%;margin-top: -30px;margin-right: 10px overflow: hidden;" id="main">
      </div>

      <script type="text/javascript">
        var data = ${array };
        var dom = document.getElementById("main");
        var myChart = echarts.init(dom);
        var app = {};
        var option = null;
        var geoCoordMap = {
          '海门':[121.15,31.89],
          '鄂尔多斯':[109.781327,39.608266],
          '招远':[120.38,37.35],
          '舟山':[122.207216,29.985295],
          '齐齐哈尔':[123.97,47.33],
          '盐城':[120.13,33.38],
          '赤峰':[118.87,42.28],
          '青岛':[120.33,36.07],
          '乳山':[121.52,36.89],
          '金昌':[102.188043,38.520089],
          '泉州':[118.58,24.93],
          '佳木斯':[130.284735,46.81378],
          '双鸭山':[131.171402,46.655102],
          '崇左':[107.357322,22.415455],
          '铜仁':[109.196161,27.726271],
          '宁德':[119.52,26.65],
          '莆田':[119.01,24.26 ],
          '丽江':[100.229628,26.875351],
          '莱西':[120.53,36.86],
          '日照':[119.46,35.42],
          '胶南':[119.97,35.88],
          '南通':[121.05,32.08],
          '拉萨':[91.11,29.97],
          '云浮':[112.02,22.93],
          '梅州':[116.1,24.55],
          '文登':[122.05,37.2],
          '上海':[121.48,31.22],
          '攀枝花':[101.718637,26.582347],
          '威海':[122.1,37.5],
          '承德':[117.93,40.97],
          '厦门':[118.1,24.46],
          '昌吉州':[87.296038,44.007058],
          '汕尾':[115.375279,22.786211],
          '潮州':[116.63,23.68],
          '丹东':[124.37,40.13],
          '太仓':[121.1,31.45],
          '曲靖':[103.79,25.51],
          '烟台':[121.39,37.52],
          '福州':[119.3,26.08],
          '瓦房店':[121.979603,39.627114],
          '即墨':[120.45,36.38],
          '抚顺':[123.97,41.97],
          '玉溪':[102.52,24.35],
          '张家口':[114.87,40.82],
          '阳泉':[113.57,37.85],
          '莱州':[119.942327,37.177017],
          '湖州':[120.1,30.86],
          '汕头':[116.69,23.39],
          '昆山':[120.95,31.39],
          '宁波':[121.56,29.86],
          '湛江':[110.359377,21.270708],
          '揭阳':[116.35,23.55],
          '荣成':[122.41,37.16],
          '连云港':[119.16,34.59],
          '葫芦岛':[120.836932,40.711052],
          '常熟':[120.74,31.64],
          '东莞':[113.75,23.04],
          '河源':[114.68,23.73],
          '淮安':[119.15,33.5],
          '泰州':[119.9,32.49],
          '南宁':[108.33,22.84],
          '营口':[122.18,40.65],
          '惠州':[114.4,23.09],
          '江阴':[120.26,31.91],
          '蓬莱':[120.75,37.8],
          '韶关':[113.62,24.84],
          '嘉峪关':[98.289152,39.77313],
          '广州':[113.23,23.16],
          '延安':[109.47,36.6],
          '太原':[112.53,37.87],
          '清远':[113.01,23.7],
          '中山':[113.38,22.52],
          '昆明':[102.73,25.04],
          '寿光':[118.73,36.86],
          '玉树州':[97.013316,33.00624],
          '盘锦':[122.070714,41.119997],
          '长治':[113.08,36.18],
          '深圳':[114.07,22.62],
          '珠海':[113.52,22.3],
          '宿迁':[118.3,33.96],
          '咸阳':[108.72,34.36],
          '铜川':[109.11,35.09],
          '平度':[119.97,36.77],
          '佛山':[113.11,23.05],
          '海口':[110.35,20.02],
          '文山州':[104.55186,23.906048],
          '江门':[113.06,22.61],
          '章丘':[117.53,36.72],
          '肇庆':[112.44,23.05],
          '大连':[121.62,38.92],
          '临汾':[111.5,36.08],
          '吴江':[120.63,31.16],
          '石嘴山':[106.39,39.04],
          '沈阳':[123.38,41.8],
          '苏州':[120.62,31.32],
          '茂名':[110.88,21.68],
          '嘉兴':[120.76,30.77],
          '长春':[125.35,43.88],
          '胶州':[120.03336,36.264622],
          '银川':[106.27,38.47],
          '张家港':[120.555821,31.875428],
          '三门峡':[111.19,34.76],
          '锦州':[121.15,41.13],
          '南昌':[115.89,28.68],
          '柳州':[109.4,24.33],
          '三亚':[109.511909,18.252847],
          '黔东南州':[107.985353,26.583992],
          '黔南州':[107.523205,26.264536],
          '黔西南州':[104.900558,25.095148],
          '绥化':[126.989095,46.646064],
          '自贡':[104.778442,29.33903],
          '吉林':[126.57,43.87],
          '阳江':[111.95,21.85],
          '泸州':[105.39,28.91],
          '西宁':[101.74,36.56],
          '宜宾':[104.56,29.77],
          '呼和浩特':[111.65,40.82],
          '成都':[104.06,30.67],
          '大同':[113.3,40.12],
          '镇江':[119.44,32.2],
          '桂林':[110.28,25.29],
          '张家界':[110.479191,29.117096],
          '宜兴':[119.82,31.36],
          '北海':[109.12,21.49],
          '西安':[108.95,34.27],
          '金坛':[119.56,31.74],
          '东营':[118.49,37.46],
          '牡丹江':[129.58,44.6],
          '遵义':[106.9,27.7],
          '绍兴':[120.58,30.01],
          '扬州':[119.42,32.39],
          '常州':[119.95,31.79],
          '潍坊':[119.1,36.62],
          '重庆':[106.54,29.59],
          '台州':[121.420757,28.656386],
          '南京':[118.78,32.04],
          '那曲':[92.067018,31.48068],
          '滨州':[118.03,37.36],
          '贵阳':[106.71,26.57],
          '安顺':[105.92827,26.228595],
          '防城港':[108.351791,21.617398],
          '无锡':[120.29,31.59],
          '本溪':[123.73,41.3],
          '克拉玛依':[84.77,45.59],
          '渭南':[109.5,34.52],
          '马鞍山':[118.48,31.56],
          '钦州':[108.638798,21.97335],
          '宝鸡':[107.15,34.38],
          '焦作':[113.21,35.24],
          '句容':[119.16,31.95],
          '北京':[116.46,39.92],
          '徐州':[117.2,34.26],
          '迪庆州':[99.713682,27.831029],
          '伊春':[128.910766,47.734685],
          '阿坝州':[102.228565,31.905763],
          '衡水':[115.72,37.72],
          '河池':[108.069948,24.699521],
          '包头':[110,40.58],
          '绵阳':[104.73,31.48],
          '乌鲁木齐':[87.68,43.77],
          '枣庄':[117.57,34.86],
          '杭州':[120.19,30.26],
          '淄博':[118.05,36.78],
          '鞍山':[122.85,41.12],
          '溧阳':[119.48,31.43],
          '库尔勒':[86.06,41.68],
          '安阳':[114.35,36.1],
          '开封':[114.35,34.79],
          '济南':[117,36.65],
          '德阳':[104.37,31.13],
          '温州':[120.65,28.01],
          '九江':[115.97,29.71],
          '邯郸':[114.47,36.6],
          '临安':[119.72,30.23],
          '兰州':[103.73,36.03],
          '沧州':[116.83,38.33],
          '临沂':[118.35,35.05],
          '南充':[106.110698,30.837793],
          '天津':[117.2,39.13],
          '富阳':[119.95,30.07],
          '泰安':[117.13,36.18],
          '诸暨':[120.23,29.71],
          '郑州':[113.65,34.76],
          '哈尔滨':[126.63,45.75],
          '聊城':[115.97,36.45],
          '芜湖':[118.38,31.33],
          '唐山':[118.02,39.63],
          '平顶山':[113.29,33.75],
          '邢台':[114.48,37.05],
          '德州':[116.29,37.45],
          '济宁':[116.59,35.38],
          '荆州':[112.239741,30.335165],
          '宜昌':[111.3,30.7],
          '义乌':[120.06,29.32],
          '丽水':[119.92,28.45],
          '洛阳':[112.44,34.7],
          '秦皇岛':[119.57,39.95],
          '株洲':[113.16,27.83],
          '石家庄':[114.48,38.03],
          '莱芜':[117.67,36.19],
          '常德':[111.69,29.05],
          '保定':[115.48,38.85],
          '湘潭':[112.91,27.87],
          '金华':[119.64,29.12],
          '岳阳':[113.09,29.37],
          '长沙':[113,28.21],
          '衢州':[118.88,28.97],
          '廊坊':[116.7,39.53],
          '菏泽':[115.480656,35.23375],
          '合肥':[117.27,31.86],
          '武汉':[114.31,30.52],
          '大庆':[125.03,46.58],
          '大兴安岭':[124.196104,51.991789],
          '楚雄州':[101.529382,25.066356],
          '兴安盟':[122.048167,46.083757],
          '陇南':[104.934573,33.39448],
          '鹤岗':[130.292472,47.338666],
          '毕节':[105.300492,27.302612],
          '怀化':[109.986959,27.557483],
          '南平':[118.181883,26.643626],
          '林芝':[94.349985,29.666941],
          '湛江':[110.365067,21.257463],
          '黑河':[127.50083,50.25069],
          '博州':[82.119231,44.56165],
          '日喀则':[88.891486,29.269023],
          '来宾':[109.231817,23.741166],
          '保山':[99.177996,25.120489],
          '漳州':[117.676205,24.517065],
          '邵阳':[111.461525,27.236811],
          '甘孜州':[101.969232,30.055144],
          '辽阳':[123.172451,41.273339]
          ,'石河子':[86.041865,44.308259],
          '阿勒泰':[88.137915,47.839744],
          '阿里':[81.107669,30.404557],
          '凉山州':[102.259591,27.892393],
          '酒泉':[98.508415,39.741474],
          '延边州':[129.485902,42.896414],
          '呼伦贝尔':[119.760822,49.201636],
          '白城':[122.840777,45.621086],
          '衡阳':[112.583819,26.898164],
          '五家渠':[87.565449,44.368899],
          '山南':[91.750644,29.229027],
          '果洛州':[100.223723,34.480485],
          '眉山':[103.84143,30.061115],
          '临沧':[100.092613,23.887806],
          '伊犁哈萨克州':[82.680923,43.23387],
          '湘西州':[109.745746,28.317951],
          '广元':[105.819687,32.44104],
          '七台河':[131.019048,45.775005]
          ,'阜新':[121.660822,42.01925],
          '鸡西':[130.941767,45.32154],
          '郴州':[113.037704,25.782264],
          '龙岩':[117.017997,25.078685],
          '三明':[117.642194,26.270835],
          '榆林':[109.745926,38.279439],
          '塔城':[82.974881,46.758684],
          '娄底':[111.996396,27.741073],
          '大理州':[100.223675,25.5969],
          '乐山':[103.760824,29.600958],
          '梧州':[111.305472,23.485395],
          '甘南州':[102.917442,34.992211],
          '黄山':[118.29357,29.734435],
          '平度':[120.006164,36.772168],
          '池州':[117.494477,30.660019],
          '辽源':[125.133686,42.923303],
          '天水':[105.736932,34.584319],
          '乌兰察布':[113.112846,41.022363]
          ,'黄南州':[102.0076,35.522852],
          '六盘水':[104.852087,26.591866],
          '红河州':[103.384065,23.367718],
          '庆阳':[107.644227,35.726801],
          '德宏州':[98.589434,24.44124],
          '海南州':[100.624066,36.284364],
          '资阳':[104.63593,30.132191],
          '贺州':[111.552594,24.411054],
          '哈密':[93.528355,42.858596],
          '定西':[104.626638,35.586056],
          '松原':[124.832995,45.136049],
          '内江':[105.073056,29.599462],
          '鹰潭':[117.03545,28.24131],
          '益阳':[112.366547,28.588088],
          '海西州':[97.342625,37.373799],
          '巴中':[106.757916,31.869189],
          '海东':[102.085207,36.51761],
          '安康':[109.038045,32.70437]
          ,'海北州':[100.879802,36.960654],
          '西双版纳州':[100.803038,22.009433],
          '铁岭':[123.85485,42.299757],
          '恩施州':[109.517433,30.308978],
          '广安':[106.63572,30.463984],
          '新乡':[113.91269,35.307258],
          '荆门':[112.21733,31.042611],
          '阿拉善盟':[105.695683,38.843075],
          '商洛':[109.934208,33.873907],
          '晋城':[112.867333,35.499834],
          '玉林':[110.151676,22.643974],
          '固原':[106.285268,36.021523],
          '临夏州':[103.215249,35.598514],
          '平凉':[106.688911,35.55011],
          '抚州':[116.360919,27.954545],
          '中卫':[105.196754,37.521124],
          '永州':[111.614648,26.435972],
          '贵港':[109.613708,23.103373]
          ,'十堰':[110.801229,32.636994],
          '昌都':[97.185582,31.140576],
          '铜陵':[117.819429,30.94093],
          '朔州':[112.479928,39.337672],
          '怒江州':[98.859932,25.860677],
          '安庆':[117.058739,30.537898],
          '吕梁':[111.143157,37.527316],
          '漯河':[114.046061,33.576279],
          '四平':[124.391382,43.175525],
          '南阳':[112.542842,33.01142],
          '景德镇':[117.186523,29.303563],
          '周口':[114.654102,33.623741],
          '张掖':[100.459892,38.93932],
          '昭通':[103.725021,27.340633],
          '新余':[114.947117,27.822322],
          '六安':[116.505253,31.755558],
          '上饶':[117.955464,28.457623],
          '吴忠':[106.208254,37.993561],
          '通化':[125.94265,41.736397],
          '驻马店':[114.049154,32.983158],
          '鹤壁':[114.29777,35.755426]
          ,'萍乡':[113.859917,27.639544],
          '许昌':[113.835312,34.02674],
          '蚌埠':[117.35708,32.929499],
          '亳州':[115.787928,33.871211],
          '白山':[126.435798,41.945859],
          '喀什':[75.992973,39.470627],
          '吉安':[114.992039,27.113848],
          '乌海':[106.831999,39.683177],
          '黄冈':[114.906618,30.446109],
          '晋中':[112.738514,37.693362],
          '宿州':[116.988692,33.636772],
          '赣州':[114.935909,25.845296],
          '朝阳':[120.446163,41.571828],
          '宜春':[114.400039,27.81113],
          '达州':[107.494973,31.214199],
          '武威':[102.640147,37.933172],
          '运城':[111.006854,35.038859],
          '黄石':[115.050683,30.216127],
          '濮阳':[115.026627,35.753298],
          '随州':[113.379358,31.717858],
          '宣城':[118.752096,30.951642]
          ,'遂宁':[105.564888,30.557491],
          '巴彦淖尔':[107.423807,40.76918],
          '阜阳':[115.820932,32.901211],
          '白银':[104.171241,36.546682],
          '信阳':[114.085491,32.128582],
          '雅安':[103.009356,29.999716],
          '咸宁':[114.300061,29.880657],
          '汉中':[107.045478,33.081569],
          '百色':[106.631821,23.901512],
          '忻州':[112.727939,38.461031],
          '商丘':[115.641886,34.438589],
          '吐鲁番':[89.181595,42.96047],
          '鄂州':[114.895594,30.384439],
          '淮北':[116.791447,33.960023],
          '滁州':[118.32457,32.317351],
          '淮南':[117.018639,32.642812],
          '锡林郭勒盟':[116.02734,43.939705],
          '阿克苏':[80.269846,41.171731],
          '通辽':[122.260363,43.633756],
          '孝感':[113.935734,30.927955],
          '和田':[79.930239,37.116774]
        };

        var convertData = function (data) {
          var res = [];
          for (var i = 0; i < data.length; i++) {
            var geoCoord = geoCoordMap[data[i].name];
            if (geoCoord) {
              res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
              });

            }
          }
          return res;
        };
        option = {
          backgroundColor: '#404a59',
          visualMap: {
            type: 'continuous', // 连续型
            min: 0,               // 值域最小值，必须参数
            max: 500,            // 值域最大值，必须参数
            calculable: true,    // 是否启用值域漫游
            inRange: {
              color: ['#50a3ba','#eac736','#d94e5d']
              // 指定数值从低到高时的颜色变化
            },
            textStyle: {
              color: '#fff'    // 值域控件的文本颜色
            }
          },
          title: {
            text: '全国主要城市空气质量',
            subtext: 'data from PM25.in',
            sublink: 'http://www.pm25.in',
            left: 'center',
            textStyle: {
              color: '#fff'
            }
          },
          tooltip : {
            trigger: 'item'
          },
          legend: {
            orient: 'vertical',
            y: 'bottom',
            x:'right',
            data:['pm2.5'],
            textStyle: {
              color: '#fff'
            }
          },
          geo: {
            map: 'china',
            label: {
              emphasis: {
                show: false
              }
            },
            roam: true,
            itemStyle: {
              normal: {
                areaColor: '#323c48',
                borderColor: '#111'
              },
              emphasis: {
                areaColor: '#2a333d'
              }
            }
          },
          series : [
            {
              name: 'pm2.5',
              type: 'scatter',
              coordinateSystem: 'geo',
              data: convertData(data),
              symbolSize: function (val) {
                return val[2] / 10;
              },
              label: {
                normal: {
                  formatter: '{b}',
                  position: 'right',
                  show: false
                },
                emphasis: {
                  show: true
                }
              },
              itemStyle: {
                normal: {
                  color: '#ddb926'
                }
              }
            },
            {
              name: 'Top 5',
              type: 'effectScatter',
              coordinateSystem: 'geo',
              data: convertData(data.sort(function (a, b) {
                return b.value - a.value;

              }).slice(0, 6)),
              symbolSize: function (val) {
                return val[2] / 10;
              },
              showEffectOn: 'render',
              rippleEffect: {
                brushType: 'stroke'
              },
              hoverAnimation: true,
              label: {
                normal: {
                  formatter: '{b}',
                  position: 'right',
                  show: true
                }
              },
              itemStyle: {
                normal: {
                  color: '#f4e925',
                  shadowBlur: 10,
                  shadowColor: '#333'
                }
              },
              zlevel: 1
            }
          ]

        };

        if (option && typeof option === "object") {
          myChart.setOption(option, true);
        }

      </script>
    </div>
  </div>
</div>
</body>
</html>

